
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() тогда	
		ЭтаФорма.ТолькоПросмотр = ОбщегоНазначенияСервер.ПолучитьДатуЗапретаПортфеля(Объект.Портфель) > Объект.Дата;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьСуммуКорректировки(Команда)

	Объект.Сумма = ТребуемаяСуммаОстатка - ТекущаяСуммаОстатка;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОстатокНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредствОстатки.Портфель КАК Портфель,
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			Портфель = &Портфель
		|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки";
	
	Запрос.УстановитьПараметр("Валюта", 	Объект.Валюта);
	Запрос.УстановитьПараметр("Период", 	Объект.Дата);
	Запрос.УстановитьПараметр("Портфель", 	Объект.Портфель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекущаяСуммаОстатка = ВыборкаДетальныеЗаписи.СуммаОстаток;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстаток(Команда)
	
	ПолучитьОстатокНаСервере();
	
КонецПроцедуры
