
Функция ПолучитьНачальнуюДатуЗагрузкиКурсаВалют() Экспорт
	
	Возврат Дата(2020,01,01,0,0,0);
	
КонецФункции

Функция ПолучитьПоследнююЗаписьКурсаДляВалюты(Валюта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Период;
	Иначе
		Возврат ПолучитьНачальнуюДатуЗагрузкиКурсаВалют();	
	КонецЕсли;
	
КонецФункции

Функция СформироватьСтрокуАдресаЗапросаРБК(Валюта, Период)
	
	АдресШаблон = "tsv/cb/%КодВалюты/%Год/%Месяц/%Число.tsv";
	
	Адрес = СтрЗаменить(АдресШаблон,"%КодВалюты", Валюта.Код);
	Адрес = СтрЗаменить(Адрес,"%Год", Формат(Год(Период),"ЧГ=0"));
	Адрес = СтрЗаменить(Адрес,"%Месяц", Месяц(Период));
	Адрес = СтрЗаменить(Адрес,"%Число", День(Период));
	
	Возврат Адрес;
	
КонецФункции

Функция СформироватьСтрокуАдресаЗапросаЦБ(Валюта, НачалоПериода, КонецПериода)
	
	АдресШаблон = "http://www.cbr.ru/scripts/XML_dynamic.asp?date_req1=%ДеньНачало/%МесяцНачало/%ГодНачало&date_req2=%ДеньКонец/%МесяцКонец/%ГодКонец&VAL_NM_RQ=%КодВалюты";
	
	Адрес = СтрЗаменить(АдресШаблон,"%КодВалюты", Валюта.КодДляЗагрузкиСЦБ); //http://www.cbr.ru/scripts/XML_val.asp?d=0
	Адрес = СтрЗаменить(Адрес,"%ГодНачало", Формат(Год(НачалоПериода),"ЧГ=0"));
	Адрес = СтрЗаменить(Адрес,"%МесяцНачало", Месяц(НачалоПериода));
	Адрес = СтрЗаменить(Адрес,"%ДеньНачало", Формат(День(НачалоПериода),"ЧЦ=2; ЧВН=" ));
	Адрес = СтрЗаменить(Адрес,"%ГодКонец", Формат(Год(КонецПериода),"ЧГ=0"));
	Адрес = СтрЗаменить(Адрес,"%МесяцКонец", Месяц(КонецПериода));
	Адрес = СтрЗаменить(Адрес,"%ДеньКонец", Формат(День(КонецПериода),"ЧЦ=2; ЧВН=" ));
	
	Возврат Адрес;
	
КонецФункции


Процедура ЗагрузкаКурсовВалютФоновоеЗадание()Экспорт
	
	//ЗагрузкаКурсовВалют();	
	
КонецПроцедуры

Процедура ЗагрузкаКурсовВалютЦБ(Валюта = Неопределено, НачалоПериода = Неопределено, КонецПериода = Неопределено) Экспорт 
	
	Если Валюта = Неопределено тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Валюта.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Валюта КАК Валюта
			|ГДЕ
			|	НЕ Валюта.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		МассивВалют = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивВалют.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	Иначе
		МассивВалют = Новый Массив;
		МассивВалют.Добавить(Валюта);
	КонецЕсли;
	
	Сервер = "www.cbr.ru";
	
	Попытка
		HTTP = Новый HTTPСоединение(Сервер);
	Исключение
		//Сообщить("Не удалось подключиться");
		//Возврат Ложь;
	КонецПопытки;
	
	Для каждого ЭлементВалюта из МассивВалют цикл
		Если НачалоПериода = Неопределено тогда
			ПоследняяДатаЗаписиКурса = ПолучитьПоследнююЗаписьКурсаДляВалюты(ЭлементВалюта);
		Иначе
			ПоследняяДатаЗаписиКурса = НачалоПериода;
		КонецЕсли;
		
		Адрес = СформироватьСтрокуАдресаЗапросаЦБ(Валюта,НачалоПериода,КонецПериода);
		HTTPЗапрос = Новый HTTPЗапрос(Адрес); 
		HTTPОтвет = HTTP.Получить(HTTPЗапрос);
		Текст = HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251");
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Текст);
		
		//В переменной Текст содержится текс в XML-формате 	
		//Перебор узлов формируется в зависимости от структуры XML
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Если ЧтениеXML.ЛокальноеИмя = "ИмяТэга" Тогда
					Читаем = Истина;
				КонецЕсли;
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
				Если Читаем Тогда
					Значение = XMLЗначение(Тип("Строка"), ЧтениеXML.Значение);
					Читаем = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;

	
		
	//Для каждого ЭлементВалюта из МассивВалют цикл
	//	Если ЭлементВалюта.Код = "810" тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если ПериодНачало = Неопределено тогда
	//		ПоследняяДатаЗаписиКурса = ПолучитьПоследнююЗаписьКурсаДляВалюты(ЭлементВалюта);
	//	Иначе
	//		ПоследняяДатаЗаписиКурса = ПериодНачало;
	//	КонецЕсли;
	//	
	//	Пока ПоследняяДатаЗаписиКурса <= ТекущаяДата() цикл
	//		
	//		Адрес = СформироватьСтрокуАдресаЗапросаЦБ(ЭлементВалюта,ПоследняяДатаЗаписиКурса);
	//		
	//		HTTPЗапрос = Новый HTTPЗапрос(Адрес); 
	//		HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	//		Текст = HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251");			
	//		Для ИндексСтроки = 1 По СтрЧислоСтрок(Текст) Цикл				
	//			СтрокаКурса = СтрПолучитьСтроку(Текст, ИндексСтроки);
	//			//Распарсить строку с курсом по символу табуляции
	//			МногострочнаяСтрока = СтрЗаменить(СтрокаКурса, "	", Символы.ПС);
	//			ДатаКурса = СтрПолучитьСтроку(МногострочнаяСтрока, 1);
	//			КратностьКурса = СтрПолучитьСтроку(МногострочнаяСтрока, 2);
	//			Курс = СтрПолучитьСтроку(МногострочнаяСтрока, 3);				
	//		КонецЦикла;			
	//		ПоследняяДатаЗаписиКурса = ПоследняяДатаЗаписиКурса + 86400;
	//	КонецЦикла;
	//	
	//КонецЦикла;	
	
КонецПроцедуры

Процедура ЗагрузкаКурсовВалютРБК(Валюта = Неопределено, Период = Неопределено, ПериодНачало = Неопределено) Экспорт 
	
	Если Валюта = Неопределено тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Валюта.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Валюта КАК Валюта
			|ГДЕ
			|	НЕ Валюта.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		МассивВалют = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивВалют.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	Иначе
		МассивВалют = Новый Массив;
		МассивВалют.Добавить(Валюта);
	КонецЕсли;
	
	Сервер = "cbrates.rbc.ru";
	
	Попытка
		HTTP = Новый HTTPСоединение(Сервер);
	Исключение
		//Сообщить("Не удалось подключиться");
		//Возврат Ложь;
	КонецПопытки;
	
	Для каждого ЭлементВалюта из МассивВалют цикл
		Если ЭлементВалюта.Код = "810" тогда
			Продолжить;
		КонецЕсли;
		
		Если ПериодНачало = Неопределено тогда
			ПоследняяДатаЗаписиКурса = ПолучитьПоследнююЗаписьКурсаДляВалюты(ЭлементВалюта);
		Иначе
			ПоследняяДатаЗаписиКурса = ПериодНачало;
		КонецЕсли;
		
		Пока ПоследняяДатаЗаписиКурса <= ТекущаяДата() цикл
			
			Адрес = СформироватьСтрокуАдресаЗапросаРБК(ЭлементВалюта,ПоследняяДатаЗаписиКурса);
			
			HTTPЗапрос = Новый HTTPЗапрос(Адрес); 
			HTTPОтвет = HTTP.Получить(HTTPЗапрос);
			Текст = HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251");			
			Для ИндексСтроки = 1 По СтрЧислоСтрок(Текст) Цикл				
				СтрокаКурса = СтрПолучитьСтроку(Текст, ИндексСтроки);
				//Распарсить строку с курсом по символу табуляции
				МногострочнаяСтрока = СтрЗаменить(СтрокаКурса, "	", Символы.ПС);
				ДатаКурса = СтрПолучитьСтроку(МногострочнаяСтрока, 1);
				КратностьКурса = СтрПолучитьСтроку(МногострочнаяСтрока, 2);
				Курс = СтрПолучитьСтроку(МногострочнаяСтрока, 3);				
			КонецЦикла;			
			ПоследняяДатаЗаписиКурса = ПоследняяДатаЗаписиКурса + 86400;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры
