
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	
	ВидДвиженияОстаткаДенежныхСредств = Документы.ПриходРасходДенежныхСредств.ПолучитьВидДвиженияОстаткаДенежныхСредств(ВидОперации);
	
	Отказ = Ложь;
	
	Если ВидДвиженияОстаткаДенежныхСредств = ВидДвиженияНакопления.Расход тогда
	
	КонецЕсли;
	
	Если НЕ Отказ тогда
		ВыполнитьДвиженияПоРегистрам(ВидДвиженияОстаткаДенежныхСредств);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ВидДвиженияОстаткаДенежныхСредств)
	
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияОстаткаДенежныхСредств;
	Движение.Период = Дата;
	Движение.Валюта = Валюта;
	Движение.ВидОперации = ВидОперации;
	Движение.Портфель = Портфель;
	Движение.Сумма = Сумма;
	
КонецПроцедуры

