
&НаСервере
Процедура ЗаполнитьКупоныНаСервере()

	ДатаКупона = НачальнаяДатаРасчета;
	
	ОтборыРегистра = Список.Отбор.Элементы;
	
	Актив = Неопределено;
	
	Для каждого ЭлементыОтбора из ОтборыРегистра Цикл 
		Если ЭлементыОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Актив") тогда
			Актив = ЭлементыОтбора.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Актив = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Пока ДатаКупона <= ДатаПогашения Цикл
		НаборЗаписей = РегистрыСведений.КупоныПоОблигациям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ДатаКупона);
		НаборЗаписей.Отбор.Актив.Установить(Актив);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() <> 0 тогда
			ЗаписьНабора = НаборЗаписей[0];
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
		КонецЕсли;
		ЗаписьНабора.Актив = Актив;
		ЗаписьНабора.Период = ДатаКупона;
		ЗаписьНабора.Номинал = Актив.Номинал;
		ЗаписьНабора.СуммаКупона = СуммаКупонаДляЗаполнения;
		ЗаписьНабора.СуммаВключаетНалог = ?(ДатаКупона > Дата(2021,1,1,0,0,0),Истина, Ложь);
		НаборЗаписей.Записать();
		
		ДатаКупона = ДатаКупона + (86400 * ПериодВыплатыДней);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКупоны(Команда)
	ЗаполнитьКупоныНаСервере();
КонецПроцедуры
