
&НаКлиенте
Процедура ПрочитатьТабличныйДокумент(Команда)
	
	ПрочитатьТабличныйДокументНаКлиенте();
	
	Если Объект.ВидЗагрузки = ПредопределенноеЗначение("Перечисление.ВидЗагрузкиВТБ.ОперацииСДС") тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаТаблицаОперацийСДС;	
	ИначеЕсли Объект.ВидЗагрузки = ПредопределенноеЗначение("Перечисление.ВидЗагрузкиВТБ.СовершенныеСделки") тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаТаблицаЗагрузкиСовершенныхСделок;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьТабличныйДокументНаКлиенте()
	
	#Если ТолстыйКлиентУправляемоеПриложение тогда
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область());
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Выполнить();
	
	ТаблицаВыгрузки = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого КолонкаТаблицы из ТаблицаВыгрузки.Колонки цикл
		Если СтрНайти(КолонкаТаблицы.Имя,"_") > 0 тогда
			НовоеИмяКолонки = СтрЗаменить(КолонкаТаблицы.Имя,"_",""); 
			ТаблицаВыгрузки.Колонки[КолонкаТаблицы.Имя].Имя = НовоеИмяКолонки;			
		КонецЕсли;
	КонецЦикла;	
	
	ТаблицаСовершенныхСделок.Очистить();
	ТаблицаОперацийСДенежнымиСредствами.Очистить();
	
	Если Объект.ВидЗагрузки = Перечисления.ВидЗагрузкиВТБ.СовершенныеСделки тогда
		
		Для каждого СтрокаТаблицы из ТаблицаВыгрузки цикл
			НоваяСтрока = ТаблицаСовершенныхСделок.Добавить();			
			НоваяСтрока.ДатаЗаключения 			= ПолучитьДатуВремяИзСделок(СтрокаТаблицы.ДатаЗаключения);	
			НоваяСтрока.Счет 					= СтрокаТаблицы.Счет;
			НоваяСтрока.НомерЗаявки 			= СтрокаТаблицы.НомерЗаявки;
			НоваяСтрока.НомерСделки 			= СтрокаТаблицы.НомерСделки;
			НоваяСтрока.НаименованиеИнструмента = СтрокаТаблицы.НаименованиеИнструмента;
			НоваяСтрока.КодИнструмента 			= СтрокаТаблицы.КодИнструмента;
			НоваяСтрока.ВидОперации 			= СтрокаТаблицы.BS;
			НоваяСтрока.Валюта					= НайтиВалюту(СтрокаТаблицы.Валюта);
			НоваяСтрока.Цена 					= СтрокаТаблицы.Цена;
			НоваяСтрока.Количество 				= СтрокаТаблицы.Колво;
			НоваяСтрока.НКД 					= СтрокаТаблицы.НКД;
			НоваяСтрока.Объем 					= СтрокаТаблицы.Объем;
			НоваяСтрока.ТипСделки 				= СтрокаТаблицы.ТипСделки;
			НоваяСтрока.ДокументСделки 			= НайтиДокументСделки(СтрокаТаблицы.НомерСделки,СтрокаТаблицы.НомерЗаявки, СтрокаТаблицы.ДатаЗаключения);
			НоваяСтрока.Актив 					= НайтиАктив(СтрокаТаблицы.КодИнструмента);
		КонецЦикла;
		
	ИначеЕсли Объект.ВидЗагрузки = Перечисления.ВидЗагрузкиВТБ.ОперацииСДС тогда
		
		Для каждого СтрокаТаблицы из ТаблицаВыгрузки цикл
			НоваяСтрока = ТаблицаОперацийСДенежнымиСредствами.Добавить();			
			НоваяСтрока.НомерРаспоряжения	= СтрокаТаблицы.НомерРаспоряжения;
			НоваяСтрока.ДокументБД			= НайтиДокументПоступленияДС(Объект.Портфель,СтрокаТаблицы.НомерРаспоряжения);
			НоваяСтрока.Тип 				= СтрокаТаблицы.Тип;
			НоваяСтрока.Подано 				= ПолучитьДатуВремя(СтрокаТаблицы.Подано);
			НоваяСтрока.Исполнено 			= ПолучитьДатуВремя(СтрокаТаблицы.Исполнено);
			НоваяСтрока.Валюта 				= Справочники.Валюта.НайтиПоКоду(СтрокаТаблицы.Валюта);
			НоваяСтрока.СчетОткуда 			= СтрокаТаблицы.СчетОткуда;
			НоваяСтрока.СчетКуда 			= СтрокаТаблицы.СчетКуда;
			НоваяСтрока.Сумма				= Число(СтрокаТаблицы.Сумма);
			НоваяСтрока.СуммаКИсполнению 	= Число(СтрокаТаблицы.СуммаКИсполнению);
			НоваяСтрока.Налог 				= Число(СтрокаТаблицы.Налог);
			НоваяСтрока.Комиссия 			= Число(СтрокаТаблицы.Комиссия);			
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДатуВремя(ДатаСтр)
	
	Возврат Дата(Лев(ДатаСтр,2) + "." + Сред(ДатаСтр,4,2) + "." + Прав(ДатаСтр,4) + " 00:00:00");
	
КонецФункции

&НаКлиенте
Функция ПолучитьДатуВремяИзСделок(ДатаСтр)
	
	Возврат Дата(Лев(ДатаСтр,2) + "." + Сред(ДатаСтр,4,2) + "." + Сред(ДатаСтр,7,4) + " " + Прав(ДатаСтр,5) + ":00");
	
КонецФункции

&НаСервере
Функция НайтиВалюту(ВалютаСтр)
	
	ВалютаДляПоиска = СтрЗаменить(ВалютаСтр,"RUR","RUB");
	
	Возврат Справочники.Валюта.НайтиПоНаименованию(ВалютаДляПоиска);
	
КонецФункции

&НаСервере
Функция НайтиДокументСделки(НомерСделки,НомерПоручения,ДатаВремяСделки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобртениеАктива.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриобртениеАктива КАК ПриобртениеАктива
		|ГДЕ
		|	ПриобртениеАктива.НомерСделки = &НомерСделки
		|	И ПриобртениеАктива.НомерПоручения = &НомерПоручения
		|	И ПриобртениеАктива.Дата = &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажаАктива.Ссылка
		|ИЗ
		|	Документ.ПродажаАктива КАК ПродажаАктива
		|ГДЕ
		|	ПродажаАктива.НомерСделки = &НомерСделки
		|	И ПродажаАктива.НомерПоручения = &НомерПоручения
		|	И ПродажаАктива.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", 			ДатаВремяСделки);
	Запрос.УстановитьПараметр("НомерПоручения", НомерПоручения);
	Запрос.УстановитьПараметр("НомерСделки", 	НомерСделки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
			
КонецФункции

&НаСервере
Функция НайтиДокументПоступленияДС(Портфель,НомерРаспоряжения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПополнениеВыводСБрокерскогоСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПополнениеВыводСБрокерскогоСчета КАК ПополнениеВыводСБрокерскогоСчета
		|ГДЕ
		|	ПополнениеВыводСБрокерскогоСчета.НомерРаспоряжения = &НомерРаспоряжения
		|	И ПополнениеВыводСБрокерскогоСчета.Портфель = &Портфель
		|	И НЕ ПополнениеВыводСБрокерскогоСчета.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомерРаспоряжения", НомерРаспоряжения);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Документы.ПополнениеВыводСБрокерскогоСчета.ПустаяСсылка();
	
КонецФункции	
	
&НаСервере
Функция НайтиАктив(ТикерСтр)
	
	Актив = Справочники.Активы.НайтиПоРеквизиту("Тикер",ТикерСтр);
	Если Актив <> Справочники.Активы.ПустаяСсылка() тогда
		Возврат Актив;
	КонецЕсли;
	
	ТикерДляПоиска = СтрЗаменить(ТикерСтр,"_SPB","");	
	ТикерДляПоиска = СтрЗаменить(ТикерДляПоиска," ",".");
	Актив = Справочники.Активы.НайтиПоРеквизиту("Тикер",ТикерДляПоиска);
	Если Актив <> Справочники.Активы.ПустаяСсылка() тогда
		Возврат Актив;
	КонецЕсли;
	
	Актив = Справочники.Активы.НайтиПоРеквизиту("Тикер",Лев(ТикерДляПоиска,3));
	Если Актив <> Справочники.Активы.ПустаяСсылка() тогда
		Возврат Актив;
	КонецЕсли;
	
	Возврат Справочники.Активы.ПустаяСсылка();
	
КонецФункции

&НаСервере
Процедура СоздатьАктивыНаСервере()

	Для каждого СтрокаТаблицы из ТаблицаСовершенныхСделок цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Актив) тогда	
			Актив = НайтиАктив(СтрокаТаблицы.КодИнструмента);
			Если Актив = Справочники.Активы.ПустаяСсылка() тогда
				НовыйАктив = Справочники.Активы.СоздатьЭлемент();
				НовыйАктив.Тикер = СтрокаТаблицы.КодИнструмента;
				НовыйАктив.Наименование = СтрокаТаблицы.НаименованиеИнструмента;
				НовыйАктив.Записать();
				СтрокаТаблицы.Актив = НовыйАктив.Ссылка;
			Иначе
				СтрокаТаблицы.Актив = Актив;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАктивы(Команда)
	СоздатьАктивыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	Для каждого СтрокаТаблицы из ТаблицаСовершенныхСделок цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументСделки) тогда
			Если СтрокаТаблицы.ВидСделки = "Покупка" тогда
				
				
				НовыйДокумент = Документы.ПриобртениеАктива.СоздатьДокумент();
				НовыйДокумент.Актив		 	= СтрокаТаблицы.Актив;
				НовыйДокумент.Дата 			= СтрокаТаблицы.ДатаВремяСделки;
				НовыйДокумент.Количество 	= СтрокаТаблицы.Количество;
				НовыйДокумент.НКД 			= СтрокаТаблицы.НКД;
				НовыйДокумент.НомерПоручения = СтрокаТаблицы.НомерПоручения;
				НовыйДокумент.НомерСделки 	= СтрокаТаблицы.НомерСделки;
				НовыйДокумент.Портфель 		= Объект.Портфель;
				НовыйДокумент.Сумма 		= СтрокаТаблицы.СуммаБезНКД;
				НовыйДокумент.СуммаКомиссии = СтрокаТаблицы.КомиссияБрокера;
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);			
			ИначеЕсли СтрокаТаблицы.ВидСделки = "Продажа" тогда
			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыДСНаСервере()

	Для каждого СтрокаТаблицы из ТаблицаОперацийСДенежнымиСредствами цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументБД) тогда
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = Документы.ПополнениеВыводСБрокерскогоСчета.СоздатьДокумент();
		НовыйДокумент.Дата 				= СтрокаТаблицы.Исполнено;
		НовыйДокумент.ВидОперации 		= ?(СтрокаТаблицы.Тип = "Зачисление",Перечисления.ВидОперацииПополнениеВыводСБрокерскогоСчета.Пополнение,Перечисления.ВидОперацииПополнениеВыводСБрокерскогоСчета.Вывод);
		НовыйДокумент.Портфель			= Объект.Портфель;
		НовыйДокумент.Валюта			= СтрокаТаблицы.Валюта;		
		НовыйДокумент.НомерРаспоряжения = СтрокаТаблицы.НомерРаспоряжения;		
		НовыйДокумент.Сумма				= СтрокаТаблицы.СуммаКИсполнению;
		НовыйДокумент.СуммаУдержанногоНалога = СтрокаТаблицы.Налог;
		НовыйДокумент.Комментарий 		= "#Создано автоматически";
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);		
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыДС(Команда)
	
	СоздатьДокументыДСНаСервере();
	ПрочитатьТабличныйДокументНаКлиенте();
	
КонецПроцедуры




