
Функция ПолучитьВидДвиженияОстаткаДенежныхСредств(ВидОперацииОстаткаДенежныхСредств) Экспорт
	
	Если ВидОперацииОстаткаДенежныхСредств = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.ВыводСБрокерскогоСчета тогда
		Возврат ВидДвиженияНакопления.Расход;
		
	ИначеЕсли ВидОперацииОстаткаДенежныхСредств = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.ВыплатаДивидендов тогда
		Возврат ВидДвиженияНакопления.Приход;
		
	ИначеЕсли ВидОперацииОстаткаДенежныхСредств = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.ВыплатаКупона тогда
		Возврат ВидДвиженияНакопления.Приход;
		
	ИначеЕсли ВидОперацииОстаткаДенежныхСредств = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.ПродажаАктива тогда
		Возврат ВидДвиженияНакопления.Приход;
		
	ИначеЕсли ВидОперацииОстаткаДенежныхСредств = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.ПополнениеБрокерскогоСчета тогда
		Возврат ВидДвиженияНакопления.Приход;
		
	ИначеЕсли ВидОперацииОстаткаДенежныхСредств = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.ОбменВалюты тогда
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
