
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	
	ВидДвиженияОстаткаДенежныхСредств = Документы.Удалить_ПриходРасходДенежныхСредств.ПолучитьВидДвиженияОстаткаДенежныхСредств(ВидОперации);
	
	Отказ = Ложь;	
	
	Если ВидДвиженияОстаткаДенежныхСредств = ВидДвиженияНакопления.Расход ИЛИ ВидДвиженияОстаткаДенежныхСредств = Неопределено тогда
		ПроверитьВозможностьПроведения(Отказ);	
	КонецЕсли;
	
	Если НЕ Отказ тогда
		ВыполнитьДвиженияПоРегистрам(ВидДвиженияОстаткаДенежныхСредств);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВозможностьПроведения(Отказ)
	
	Движения.ОстаткиДенежныхСредств.Очистить();
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредствОстатки.Портфель КАК Портфель,
		|	СУММА(ОстаткиДенежныхСредствОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&Период,
		|			Портфель = &Портфель
		|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредствОстатки.Валюта,
		|	ОстаткиДенежныхСредствОстатки.Портфель";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СуммаОстаток < (Сумма + СуммаКомиссии) тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ВидДвиженияОстаткаДенежныхСредств)
	
	Если ВидДвиженияОстаткаДенежныхСредств = Неопределено тогда
		
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ВидОперации = ВидОперации;		
		Движение.Портфель = Портфель;
		
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
		
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ВидОперации = ВидОперации;
		Движение.Портфель = Портфель;
		
		Движение.Валюта = ВалютаПриход;
		Движение.Сумма = СуммаПриход;
		
	Иначе
		
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияОстаткаДенежныхСредств;
		Движение.Период = Дата;
		Движение.ВидОперации = ВидОперации;
		Движение.Портфель = Портфель;
		
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
		
	КонецЕсли;
	
	Если СуммаКомиссии <> 0 тогда
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ВидОперации = Перечисления.ВидыОперацийПриходРасходДенежныхСредств.КомиссияБрокера;		
		Движение.Портфель = Портфель;
		
		Движение.Валюта = Валюта;
		Движение.Сумма = СуммаКомиссии;
	КонецЕсли;
	

	
КонецПроцедуры


