
&НаКлиенте
Процедура ПрочитатьТабличныйДокумент(Команда)
	
	ПрочитатьТабличныйДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьТабличныйДокументНаКлиенте()
	
	#Если ТолстыйКлиентУправляемоеПриложение тогда
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область());
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Выполнить();
	
	ТаблицаВыгрузки = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого КолонкаТаблицы из ТаблицаВыгрузки.Колонки цикл
		Если СтрНайти(КолонкаТаблицы.Имя,"_") > 0 тогда
			НовоеИмяКолонки = СтрЗаменить(КолонкаТаблицы.Имя,"_",""); 
			ТаблицаВыгрузки.Колонки[КолонкаТаблицы.Имя].Имя = НовоеИмяКолонки;			
		КонецЕсли;
	КонецЦикла;	
	
	ТаблицаСовершенныхСделок.Очистить();
	
	Если Объект.ВидЗагрузки = Перечисления.ВидЗагрузкиТинькофф.СовершенныеСделки тогда
		
		Для каждого СтрокаТаблицы из ТаблицаВыгрузки цикл
			НоваяСтрока = ТаблицаСовершенныхСделок.Добавить();			
			НоваяСтрока.НомерСделки 			= СтрокаТаблицы.НомерСделки;	
			НоваяСтрока.НомерПоручения 			= СтрокаТаблицы.НомерПоручения;
			НоваяСтрока.ДатаВремяСделки 		= ПолучитьДатуВремя(СтрокаТаблицы.ДатаЗаключения, СтрокаТаблицы.Время);
			НоваяСтрока.ВидСделки 				= СтрокаТаблицы.ВидСделки;
			НоваяСтрока.СокращенноеНаименованиеАктива = СтрокаТаблицы.СокращенноеНаименованиеАктива;
			НоваяСтрока.ТикерАктива 			= СтрокаТаблицы.КодАктива;
			НоваяСтрока.ЦенаЗаЕдиницу 			= СтрокаТаблицы.ЦенаЗаЕдиницу;
			НоваяСтрока.Валюта					= НайтиВалюту(СтрокаТаблицы.ВалютаРасчетов);
			НоваяСтрока.Количество 				= СтрокаТаблицы.Количество;
			НоваяСтрока.СуммаБезНКД 			= СтрокаТаблицы.СуммаБезНКД;
			НоваяСтрока.НКД 					= СтрокаТаблицы.НКД;
			НоваяСтрока.КомиссияБрокера 		= СтрокаТаблицы.КомиссияБрокера;
			НоваяСтрока.ДокументСделки 			= НайтиДокументСделки(НоваяСтрока.НомерСделки,НоваяСтрока.НомерПоручения, НоваяСтрока.ДатаВремяСделки);
			НоваяСтрока.Актив 					= НайтиАктив(НоваяСтрока.ТикерАктива);
		КонецЦикла;
		
	ИначеЕсли Объект.ВидЗагрузки = Перечисления.ВидЗагрузкиТинькофф.ОперацииСДС тогда
		
		
	КонецЕсли;
	
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДатуВремя(ДатаСтр,ВремяСтр)
	
	Возврат Дата(ДатаСтр + " " + ВремяСтр);
	
КонецФункции

&НаСервере
Функция НайтиВалюту(ВалютаСтр)
	
	Возврат Справочники.Валюта.НайтиПоНаименованию(ВалютаСтр);
	
КонецФункции

&НаСервере
Функция НайтиДокументСделки(НомерСделки,НомерПоручения,ДатаВремяСделки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриобретениеАктива.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриобретениеАктива КАК ПриобретениеАктива
		|ГДЕ
		|	ПриобретениеАктива.НомерСделки = &НомерСделки
		|	И ПриобретениеАктива.НомерПоручения = &НомерПоручения
		|	И ПриобретениеАктива.Дата = &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажаАктива.Ссылка
		|ИЗ
		|	Документ.ПродажаАктива КАК ПродажаАктива
		|ГДЕ
		|	ПродажаАктива.НомерСделки = &НомерСделки
		|	И ПродажаАктива.НомерПоручения = &НомерПоручения
		|	И ПродажаАктива.Дата = &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеВалюты.Ссылка
		|ИЗ
		|	Документ.ПриобретениеВалюты КАК ПриобретениеВалюты
		|ГДЕ
		|	ПриобретениеВалюты.НомерСделки = &НомерСделки
		|	И ПриобретениеВалюты.НомерПоручения = &НомерПоручения
		|	И ПриобретениеВалюты.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", 			ДатаВремяСделки);
	Запрос.УстановитьПараметр("НомерПоручения", НомерПоручения);
	Запрос.УстановитьПараметр("НомерСделки", 	НомерСделки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
			
КонецФункции

&НаСервере
Функция НайтиАктив(ТикерСтр)
	
	Возврат Справочники.Активы.НайтиПоРеквизиту("Тикер",ТикерСтр);
	
КонецФункции

&НаСервере
Процедура СоздатьАктивыНаСервере()

	Для каждого СтрокаТаблицы из ТаблицаСовершенныхСделок цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Актив) тогда	
			//НовыйАктив = Справочники.Активы.СоздатьЭлемент();
			//НовыйАктив.
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАктивы(Команда)
	СоздатьАктивыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	Для каждого СтрокаТаблицы из ТаблицаСовершенныхСделок цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументСделки) тогда
			Если СтрокаТаблицы.ВидСделки = "Покупка" тогда
				НовыйДокумент = Документы.ПриобретениеАктива.СоздатьДокумент();
				НовыйДокумент.Актив = СтрокаТаблицы.Актив;
				НовыйДокумент.Дата = СтрокаТаблицы.ДатаВремяСделки;
				НовыйДокумент.Количество = СтрокаТаблицы.Количество;
				НовыйДокумент.НКД = СтрокаТаблицы.НКД;
				НовыйДокумент.НомерПоручения = СтрокаТаблицы.НомерПоручения;
				НовыйДокумент.НомерСделки = СтрокаТаблицы.НомерСделки;
				НовыйДокумент.Портфель = Объект.Портфель;
				НовыйДокумент.Сумма = СтрокаТаблицы.СуммаБезНКД;
				НовыйДокумент.СуммаКомиссии = СтрокаТаблицы.КомиссияБрокера;
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);			
			ИначеЕсли СтрокаТаблицы.ВидСделки = "Продажа" тогда
			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	Токен = ИнтеграцияСТинькоффПоAPIСервер.ТокенПоПортфелю(Объект.Портфель);
	ИнтеграцияСТинькоффПоAPIСервер.ПолучитьТаблицуОперацийПоПортфелю(Токен,НачалоГода(ТекущаяДата()),ТекущаяДата());
	
КонецПроцедуры





