
Функция ПолучитьПроцентКомисииБрокера(Брокер,Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцентКомиссииБрокераСрезПоследних.Брокер КАК Брокер,
		|	ПроцентКомиссииБрокераСрезПоследних.ПроцентКомиссии КАК ПроцентКомиссии
		|ИЗ
		|	РегистрСведений.ПроцентКомиссииБрокера.СрезПоследних(&Период, Брокер = &Брокер) КАК ПроцентКомиссииБрокераСрезПоследних";
	
	Запрос.УстановитьПараметр("Брокер", Брокер);
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено,ТекущаяДата(),Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ПроцентКомиссии; 
	КонецЦикла;
		
КонецФункции

Функция РассчитатьСуммуКомиссииБрокера(СуммаОперации, Брокер, Период) Экспорт 
	
	ПроцентКомиссииБрокера = ПолучитьПроцентКомисииБрокера(Брокер, Период);
	СуммаКомиссии = (СуммаОперации * ПроцентКомиссииБрокера) / 100;
	
	Возврат Окр(СуммаКомиссии,2);
	
КонецФункции