
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() тогда
		Брокер = Объект.Портфель.Брокер;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если НЕ Объект.СуммаКомиссииУстановленаВручную тогда
		Объект.СуммаКомиссии = ОбщегоНазначенияСервер.РассчитатьСуммуКомиссииБрокера(Объект.Сумма,Брокер,Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПортфельПриИзмененииНаСервере()

	Брокер = Объект.Портфель.Брокер;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПортфельПриИзменении(Элемент)
	
	ПортфельПриИзмененииНаСервере();
	
КонецПроцедуры
