
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьИОтобразитьПоследнююЦену();
	ПолучитьИОтобразитьСреднююЦену();
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИОтобразитьПоследнююЦену()

	Если Объект.Биржа = Перечисления.Биржа.МОЕХ тогда
		ЗагрузкаСМосковскойБиржиСервер.ПолучитьИЗаписатьЦенуАктиваНаДату(Объект.Ссылка,ТекущаяДата());
	Иначе
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущаяЦенаАктиваСрезПоследних.Период КАК Период,
		|	ТекущаяЦенаАктиваСрезПоследних.Актив КАК Актив,
		|	ТекущаяЦенаАктиваСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ТекущаяЦенаАктива.СрезПоследних(&Период, Актив = &Актив) КАК ТекущаяЦенаАктиваСрезПоследних";
	
	Запрос.УстановитьПараметр("Актив", Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Элементы.ТекущаяЦена.Заголовок = "Цена на " + Строка(ВыборкаДетальныеЗаписи.Период);
		ТекущаяЦена = ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Элементы.ТекущаяЦена.Заголовок = "Цены не загружены";
		ТекущаяЦена = 0;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИОтобразитьСреднююЦену()

		
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьДанныеСБиржи(Команда)
	
	ПолучитьИОтобразитьПоследнююЦену();	
	
КонецПроцедуры



