
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() тогда
		Брокер = Объект.Портфель.Брокер;
		ВидАктива = Объект.Актив.Вид;
			
		ЭтаФорма.ТолькоПросмотр = ОбщегоНазначенияСервер.ПолучитьДатуЗапретаПортфеля(Объект.Портфель) > Объект.Дата;		
	КонецЕсли;
	
	УстановкаОтображенияВидимости();
	
КонецПроцедуры

&НаСервере
Процедура УстановкаОтображенияВидимости()
	
	Если ВидАктива = Перечисления.ВидАктива.Облигация тогда
		Элементы.НКД.Видимость = Истина;
	Иначе
		Элементы.НКД.Видимость = Ложь;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если НЕ Объект.СуммаКомиссииУстановленаВручную тогда
		Объект.СуммаКомиссии = ОбщегоНазначенияСервер.РассчитатьСуммуКомиссииБрокера(Объект.Сумма,Брокер,Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПортфельПриИзмененииНаСервере()

	Брокер = Объект.Портфель.Брокер;
	ВидАктива = Объект.Актив.Вид;
	
	УстановкаОтображенияВидимости();
	
КонецПроцедуры

&НаКлиенте
Процедура ПортфельПриИзменении(Элемент)
	
	ПортфельПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивПриИзменении(Элемент)
	
	АктивПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура АктивПриИзмененииНаСервере()

	Брокер = Объект.Портфель.Брокер;
	ВидАктива = Объект.Актив.Вид;
	
	УстановкаОтображенияВидимости();
	
КонецПроцедуры

