
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ВидОперации = Перечисления.ВидОперацииПополнениеВыводСБрокерскогоСчета.Пополнение тогда
		
		Движения.ОстаткиДенежныхСредств.Очистить();
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движения.Записать();
		
		// регистр ОстаткиДенежныхСредств Приход
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Валюта = Валюта;
		Движение.Портфель = Портфель;
		Движение.Сумма = Сумма;
		
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииПополнениеВыводСБрокерскогоСчета.Вывод тогда
		
		Движения.ОстаткиДенежныхСредств.Очистить();
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движения.Записать();
		
		//Контроль минусовых остатков пока отключен пока отключен, так как могут быть операции покупки валюты которые в этом документе не отражаются. минусы должны закрыться приобретением актива валюта
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		//	|	ОстаткиДенежныхСредствОстатки.Портфель КАК Портфель,
		//	|	СУММА(ОстаткиДенежныхСредствОстатки.СуммаОстаток) КАК СуммаОстаток
		//	|ИЗ
		//	|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		//	|			&Период,
		//	|			Портфель = &Портфель
		//	|				И Валюта = &Валюта) КАК ОстаткиДенежныхСредствОстатки
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ОстаткиДенежныхСредствОстатки.Валюта,
		//	|	ОстаткиДенежныхСредствОстатки.Портфель";
		//
		//Запрос.УстановитьПараметр("Валюта", Валюта);
		//Запрос.УстановитьПараметр("Период", Новый Граница(Ссылка,ВидГраницы.Исключая));
		//Запрос.УстановитьПараметр("Портфель", Портфель);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	Если ВыборкаДетальныеЗаписи.СуммаОстаток < Сумма + СуммаУдержанногоНалога тогда
		//		Отказ = Истина;
		//	Иначе
		//		// регистр ОстаткиДенежныхСредств Расход
		//		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		//		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//		Движение.Период = Дата;
		//		Движение.Валюта = Валюта;
		//		Движение.Портфель = Портфель;
		//		Движение.Сумма = Сумма + СуммаУдержанногоНалога;	
		//	КонецЕсли;
		//КонецЦикла;	
		
		//регистр ОстаткиДенежныхСредств Расход
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Валюта = Валюта;
		Движение.Портфель = Портфель;
		Движение.Сумма = Сумма + СуммаУдержанногоНалога;
		
	КонецЕсли;
	
КонецПроцедуры
