
&НаКлиенте
Процедура ЗагрузитьВсеДанныеОКотировках(Команда)
	
	ИнтеграцияСТинькоффПоAPIСервер.ЗагрузитьЦеныАктивов();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитататьЦенуАктиваВРублях(Команда)
	ИнтеграцияСТинькоффПоAPIСервер.РасчитатьЦенуАктиваВРублях();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроведениеПоПартиямНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыплатаДивидендовКупонов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ВыборкаДокументов
		|ИЗ
		|	Документ.ВыплатаДивидендовКупонов КАК ВыплатаДивидендовКупонов
		|ГДЕ
		|	ВыплатаДивидендовКупонов.Портфель = &Портфель
		|	И ВыплатаДивидендовКупонов.Проведен
		|	И ВыплатаДивидендовКупонов.Дата > &ДатаНачала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПополнениеВыводСБрокерскогоСчета.Ссылка
		|ИЗ
		|	Документ.ПополнениеВыводСБрокерскогоСчета КАК ПополнениеВыводСБрокерскогоСчета
		|ГДЕ
		|	ПополнениеВыводСБрокерскогоСчета.Портфель = &Портфель
		|	И ПополнениеВыводСБрокерскогоСчета.Проведен
		|	И ПополнениеВыводСБрокерскогоСчета.Дата > &ДатаНачала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеАктива.Ссылка
		|ИЗ
		|	Документ.ПриобретениеАктива КАК ПриобретениеАктива
		|ГДЕ
		|	ПриобретениеАктива.Портфель = &Портфель
		|	И ПриобретениеАктива.Проведен
		|	И ПриобретениеАктива.Дата > &ДатаНачала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеВалюты.Ссылка
		|ИЗ
		|	Документ.ПриобретениеВалюты КАК ПриобретениеВалюты
		|ГДЕ
		|	ПриобретениеВалюты.Портфель = &Портфель
		|	И ПриобретениеВалюты.Проведен
		|	И ПриобретениеВалюты.Дата > &ДатаНачала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажаАктива.Ссылка
		|ИЗ
		|	Документ.ПродажаАктива КАК ПродажаАктива
		|ГДЕ
		|	ПродажаАктива.Портфель = &Портфель
		|	И ПродажаАктива.Проведен
		|	И ПродажаАктива.Дата > &ДатаНачала
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажаВалюты.Ссылка
		|ИЗ
		|	Документ.ПродажаВалюты КАК ПродажаВалюты
		|ГДЕ
		|	ПродажаВалюты.Портфель = &Портфель
		|	И ПродажаВалюты.Проведен
		|	И ПродажаВалюты.Дата > &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыборкаДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ВыборкаДокументов КАК ВТ_ВыборкаДокументов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ВыборкаДокументов.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачалаПроведения);
	Запрос.УстановитьПараметр("Портфель", Объект.Портфель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроведениеПоПартиям(Команда)
	ВыполнитьПроведениеПоПартиямНаСервере();
КонецПроцедуры
