
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиДенежныхСредств Расход
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период 	 = Дата;
	Движение.Портфель 	 = Портфель;
	Движение.Валюта 	 = ВалютаСписания;
	Движение.Сумма 		 = СуммаСписания;
	
	Если СуммаКомиссии <> 0 Тогда
		Движения.ОстаткиДенежныхСредств.Записывать = Истина;
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 	 = Дата;
		Движение.Портфель 	 = Портфель;
		Движение.Валюта 	 = ВалютаКомиссии;
		Движение.Сумма 		 = СуммаКомиссии;	
	КонецЕсли;
	
	// регистр ОстаткиДенежныхСредств Приход
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период 	 = Дата;
	Движение.Портфель 	 = Портфель;
	Движение.Валюта 	 = ВалютаПриобретения;
	Движение.Сумма 		 = СуммаПриобретения;

КонецПроцедуры
